{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: opentree in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (0.0.3)\n",
      "Requirement already satisfied: requests>=2.18 in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (from opentree) (2.24.0)\n",
      "Requirement already satisfied: setuptools in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (from opentree) (49.6.0.post20200814)\n",
      "Requirement already satisfied: DendroPy>=4.4.0 in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (from opentree) (4.4.0)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (from requests>=2.18->opentree) (2020.6.20)\n",
      "Requirement already satisfied: chardet<4,>=3.0.2 in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (from requests>=2.18->opentree) (3.0.4)\n",
      "Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (from requests>=2.18->opentree) (1.25.10)\n",
      "Requirement already satisfied: idna<3,>=2.5 in /opt/miniconda3/envs/bio/lib/python3.7/site-packages (from requests>=2.18->opentree) (2.10)\n"
     ]
    }
   ],
   "source": [
    "!pip install opentree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from opentree import OT\n",
    "import requests\n",
    "import pprint\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get the list of taxa from a textfile.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "fi = open(\"/Users/emily/Downloads/ObservedPlantSpecies.txt\").readlines()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['superkingdom', 'phylum', 'class', 'order', 'family', 'genus', 'species\\n']"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fi[0].split(';')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'genus'"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fi[0].split(';')[5]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "all_genera = set()\n",
    "for taxon in fi:\n",
    "    try:\n",
    "        genus = taxon.strip().split(';')[6]\n",
    "        all_genera.add(genus)\n",
    "    except:\n",
    "        pass\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "232"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(all_genera)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "351680"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "OT.get_ottid_from_name('Stappia')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Failed to get an ottid for Symphotrichum lanceolatum\n",
      "Failed to get an ottid for species\n"
     ]
    }
   ],
   "source": [
    "matches = dict()\n",
    "ottid_to_genus = dict()\n",
    "for genus in all_genera:\n",
    "    if len(genus) > 2:\n",
    "        try:\n",
    "            ott_id = OT.get_ottid_from_name(genus)\n",
    "            ottid_to_genus['ott{}'.format(ott_id)]=genus\n",
    "            matches[genus] = ott_id\n",
    "        except:\n",
    "            print(\"Failed to get an ottid for {}\".format(genus))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "output = OT.synth_induced_tree(ott_ids=list(matches.values()),  label_format='name_and_id')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Create a dictionary that matches the taxa that are returned with the input taxa requested.\n",
    "relabel = dict()\n",
    "broken = output.response_dict['broken']\n",
    "for taxon in broken:\n",
    "    remap = broken[taxon]\n",
    "    if remap.startswith('mrca'):\n",
    "        if remap not in relabel:\n",
    "            relabel[remap] = []\n",
    "        relabel[remap].append(\"{} {}\".format(ottid_to_genus[taxon], taxon))\n",
    "    if remap.startswith('ott'):\n",
    "        if remap not in relabel:\n",
    "            relabel[remap] = []\n",
    "        relabel[remap].append(\"{} {}\".format(ottid_to_genus[taxon], taxon))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "import copy\n",
    "backuptree = copy.deepcopy(output.tree)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Gos through each taxon in teh tree that is returned, and matches it to the rquested genus or genera, and adds those to the label\n",
    "for taxon in backuptree.taxon_namespace:\n",
    "    if taxon.label.startswith('mrca'):\n",
    "        taxon.label = 'MRCA of taxa in '+' '.join(relabel[taxon.label])\n",
    "    else:\n",
    "        ott = taxon.label.split()[-1]\n",
    "        if ott in relabel:\n",
    "            added_taxa = ' MRCA of taxa in '+' '.join(relabel[ott])\n",
    "            taxon.label = taxon.label + added_taxa"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Some characters in names mess up newick tree readers\n",
    "def remove_problem_characters(instr, prob_char = \"():#\", replace_w = '?'):\n",
    "    problem_characters = set(prob_char)\n",
    "    for char in problem_characters:\n",
    "        instr = instr.replace(char,replace_w)\n",
    "    return instr"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Some of these taxon names are still causing issues...\n",
    "for taxon in backuptree.taxon_namespace:\n",
    "    taxon.label = remove_problem_characters(taxon.label)\n",
    "\n",
    "for node in backuptree:\n",
    "    if node.label:\n",
    "        node.label = remove_problem_characters(node.label)\n",
    "\n",
    "# Write the tree out to a file in Newick format\n",
    "treefile = 'bigbio_clean.tre'\n",
    "backuptree.write(path = treefile, schema = 'newick')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Tree annotations\n",
    "We can display additional data on the tree on ITOL by adding an annotation file.\n",
    "This will map each node label to data about it.\n",
    "\n",
    "We can get data about a lot of species using the Encyclopedia of Life API."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Most labels are just the taxon and OTT ID, but some end up with weird other stuff\n",
    "# Keep track of the actual species name that each label is for\n",
    "name_to_label = {}\n",
    "for taxon in backuptree.taxon_namespace:\n",
    "    name_to_label[ottid_to_genus[taxon.label.split()[-1]]] = taxon.label"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Oxalis stricta ott237293\n",
      "Euphorbia corollata ott827132\n",
      "Euphorbia geyeri ott770977\n",
      "Euphorbia glyptosperma ott145990\n",
      "Euphorbia maculata ott683660\n",
      "Populus tremuloides ott8858\n",
      "Salix discolor ott164187\n",
      "Viola pedata ott740286\n",
      "Viola sagittata ott265431\n",
      "Viola pallens ott697882\n",
      "Viola pedatifida ott3915440\n",
      "Urtica dioica ott267705\n",
      "Ulmus americana ott706094\n",
      "Ceanothus americanus ott559254\n",
      "Potentilla argentea ott355267\n",
      "Potentilla recta ott768212\n",
      "Potentilla norvegica ott902633\n",
      "Drymocallis arguta ott328274\n",
      "Fragaria virginiana ott1004791\n",
      "Fragaria vesca ott852873\n",
      "Potentilla simplex ott396171\n",
      "Rosa arkansana ott252379\n",
      "Rubus occidentalis ott670811\n",
      "Rubus idaeus ott156929\n",
      "Rubus flagellaris ott896744\n",
      "Spiraea alba ott774987\n",
      "Prunus pumila ott180918\n",
      "Prunus pensylvanica ott180915\n",
      "Corylus americana ott731679\n",
      "Alnus incana ott791133\n",
      "Quercus macrocarpa ott37377\n",
      "Quercus ellipsoidalis ott775280\n",
      "Quercus rubra ott791115\n",
      "Astragalus canadensis ott314154\n",
      "Trifolium repens ott116218\n",
      "Trifolium hybridum ott1066895\n",
      "Trifolium pratense ott839027\n",
      "Lathyrus venosus ott540134\n",
      "Vicia villosa ott1065968\n",
      "Medicago lupulina ott38032\n",
      "Medicago sativa ott1086789\n",
      "Melilotus albus ott38042\n",
      "Amphicarpaea bracteata ott1063924\n",
      "Desmodium canadense ott703608\n",
      "Lespedeza capitata ott822724\n",
      "Dalea purpurea ott815131\n",
      "Dalea villosa ott3928431\n",
      "Dalea candida ott327142\n",
      "Amorpha canescens ott359473\n",
      "Lupinus perennis ott902811\n",
      "Baptisia leucantha ott7055938\n",
      "Chamaecrista fasciculata ott959671\n",
      "Polygala polygama ott377910\n",
      "Rhus glabra ott598794\n",
      "Acer negundo ott948925\n",
      "Arabis hirsuta ott550043\n",
      "Boechera divaricarpa ott3932856\n",
      "Turritis glabra ott407496\n",
      "Lepidium densiflorum ott806482\n",
      "Lepidium virginicum ott872349\n",
      "Berteroa incana ott622451\n",
      "Crocanthemum bicknellii ott6114554\n",
      "Lechea stricta ott3942956\n",
      "Geranium maculatum ott3942222\n",
      "Circaea lutetiana ott368031\n",
      "Oenothera biennis ott12659\n",
      "Oenothera parviflora ott891451\n",
      "Parthenocissus quinquefolia ott329904\n",
      "Penthorum sedoides ott547209\n",
      "Penstemon grandiflorus ott323784\n",
      "Penstemon gracilis ott998397\n",
      "Linaria vulgaris ott989669\n",
      "Plantago patagonica ott811322\n",
      "Veronicastrum virginicum ott930105\n",
      "Verbascum thapsus ott35629\n",
      "Pedicularis canadensis ott3882309\n",
      "Pycnanthemum virginianum ott626514\n",
      "Monarda punctata ott514020\n",
      "Monarda fistulosa ott830204\n",
      "Hedeoma hispida ott3882960\n",
      "Stachys palustris ott818527\n",
      "Scutellaria lateriflora ott583395\n",
      "Verbena bracteata ott376070\n",
      "Lithospermum carolinense ott955175\n",
      "Lithospermum canescens ott955182\n",
      "Convolvulus arvensis ott1071032\n",
      "Solanum americanum ott756802\n",
      "Solanum dulcamara ott121226\n",
      "Physalis heterophylla ott940381\n",
      "Physalis virginiana ott146523\n",
      "Asclepias syriaca ott148395\n",
      "Asclepias tuberosa ott920656\n",
      "Asclepias ovalifolia ott859603\n",
      "Asclepias incarnata ott662160\n",
      "Asclepias verticillata ott1081157\n",
      "Apocynum cannabinum ott303938\n",
      "Apocynum androsaemifolium ott513856\n",
      "Taraxacum officinale ott451182\n",
      "Crepis tectorum ott368809\n",
      "Lactuca canadensis ott394067\n",
      "Lactuca biennis ott439510\n",
      "Lactuca serriola ott104466\n",
      "Hieracium longipilum ott1016026\n",
      "Hieracium kalmii ott5795194\n",
      "Pilosella aurantiaca ott285884\n",
      "Tragopogon dubius ott462870\n",
      "Nabalus racemosus ott1016052\n",
      "Coreopsis palmata ott336180\n",
      "Ambrosia psilostachya ott27846\n",
      "Ambrosia artemisiifolia ott465438\n",
      "Helianthus giganteus ott195521\n",
      "Helianthus hirsutus ott1020858\n",
      "Rudbeckia hirta ott837485\n",
      "Liatris aspera ott555650\n",
      "Liatris pycnostachya ott1082120\n",
      "Packera paupercula ott107905\n",
      "Achillea millefolium ott828103\n",
      "Artemisia ludoviciana ott202533\n",
      "Artemisia campestris ott408655\n",
      "Pseudognaphalium obtusifolium ott250211\n",
      "Antennaria plantaginifolia ott541000\n",
      "Antennaria neglecta ott541006\n",
      "Erigeron strigosus ott964716\n",
      "Erigeron annuus ott747367\n",
      "Erigeron canadensis ott1008406\n",
      "Solidago missouriensis ott123743\n",
      "Solidago rigida ott414839\n",
      "Solidago speciosa ott265097\n",
      "Euthamia graminifolia ott957394\n",
      "Solidago nemoralis ott788652\n",
      "Solidago canadensis ott872344\n",
      "Solidago gigantea ott1083535\n",
      "Symphyotrichum ericoides ott336716\n",
      "Symphyotrichum boreale ott742902\n",
      "Symphyotrichum oolentangiense ott3898549\n",
      "Cirsium discolor ott133368\n",
      "Cirsium arvense ott591412\n",
      "Heterotheca villosa ott583696\n",
      "Campanula rotundifolia ott667590\n",
      "Lobelia spicata ott3892855\n",
      "Zizia aurea ott428216\n",
      "Zizia aptera ott740223\n",
      "Phlox pilosa ott486687\n",
      "Cornus sericea ott55325\n",
      "Silene latifolia ott609504\n",
      "Silene antirrhina ott205376\n",
      "Moehringia lateriflora ott320848\n",
      "Stellaria longifolia ott689106\n",
      "Kali turgidum ott623574\n",
      "Chenopodium leptophyllum ott888050\n",
      "Chenopodium album ott892395\n",
      "Portulaca oleracea ott883494\n",
      "Mollugo verticillata ott584113\n",
      "Mirabilis albida ott34173\n",
      "Mirabilis nyctaginea ott358747\n",
      "Polygonum articulatum ott302159\n",
      "Polygonum tenue ott7049767\n",
      "Fallopia convolvulus ott362478\n",
      "Rumex acetosella ott763019\n",
      "Persicaria pensylvanica ott701572\n",
      "Persicaria maculosa ott439770\n",
      "Comandra umbellata ott964845\n",
      "Delphinium carolinianum ott529153\n",
      "Ranunculus rhomboideus ott72007\n",
      "Anemone cylindrica ott836008\n",
      "Tradescantia occidentalis ott500828\n",
      "Tradescantia bracteata ott1077462\n",
      "Bromus inermis ott990211\n",
      "Leersia oryzoides ott137222\n",
      "Elymus canadensis ott762951\n",
      "Elymus repens ott218255\n",
      "Poa pratensis ott1079463\n",
      "Poa nemoralis ott814183\n",
      "Poa compressa ott923690\n",
      "Poa palustris ott923698\n",
      "Phleum pratense ott578767\n",
      "Festuca octoflora ott33577\n",
      "Festuca ovina ott606687\n",
      "Calamagrostis canadensis ott792769\n",
      "Agrostis scabra ott342671\n",
      "Koeleria pyramidata ott1001022\n",
      "Phalaris arundinacea ott408214\n",
      "Hesperostipa comata ott751368\n",
      "Hesperostipa spartea ott997790\n",
      "Setaria viridis ott552997\n",
      "Setaria italica ott553005\n",
      "Setaria pumila ott604449\n",
      "Cenchrus longispinus ott7048118\n",
      "Panicum capillare ott755496\n",
      "Digitaria sanguinalis ott971465\n",
      "Digitaria ischaemum ott1015683\n",
      "Digitaria cognata ott3956373\n",
      "Dichanthelium oligosanthes ott328741\n",
      "Dichanthelium acuminatum ott717898\n",
      "Dichanthelium perlongum ott7048145\n",
      "Trachypogon spicatus ott816987\n",
      "Sorghastrum nutans ott338456\n",
      "Andropogon gerardi ott761207\n",
      "Schizachyrium scoparium ott338458\n",
      "Paspalum setaceum ott228282\n",
      "Muhlenbergia racemosa ott451699\n",
      "Sporobolus cryptandrus ott1062982\n",
      "Sporobolus rigidus ott755494\n",
      "Sporobolus heterolepis ott819815\n",
      "Bouteloua dactyloides ott342465\n",
      "Bouteloua hirsuta ott495508\n",
      "Bouteloua gracilis ott527781\n",
      "Bouteloua curtipendula ott98975\n",
      "Eragrostis spectabilis ott853365\n",
      "Eragrostis trichodes ott3954224\n",
      "Aristida basiramea ott3953345\n",
      "Pascopyrum smithii ott384480\n",
      "Carex muehlenbergii ott382027\n",
      "Carex pensylvanica ott511536\n",
      "Scleria triglomerata ott57517\n",
      "Cyperus filiculmis ott3959536\n",
      "Allium stellatum ott626972\n",
      "Polygonatum biflorum ott497824\n",
      "Maianthemum racemosum ott497816\n",
      "Maianthemum stellatum ott685078\n",
      "Asparagus officinalis ott748359\n",
      "Sisyrinchium campestre ott328466\n",
      "Pinus strobus ott568616\n",
      "Equisetum hyemale ott93161\n",
      "Equisetum laevigatum ott1031019\n",
      "Equisetum arvense ott718999\n",
      "Panicum virgatum ?in domain Bacteria? ott5256340\n"
     ]
    }
   ],
   "source": [
    "for taxon in backuptree.taxon_namespace:\n",
    "    print(taxon.label)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## API requests\n",
    "Here are some helper functions that we will use to make different types of requests to the Encyclopedia of Life API. Queries must be made using Cypher Query Language."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "\n",
    "# Put your EOL API token here\n",
    "token = \"eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyIjoiZXNvdGhAdWNzYy5lZHUiLCJlbmNyeXB0ZWRfcGFzc3dvcmQiOiIkMmEkMTEkOEcxN0kwN3BaakxTcFlGV3RMMnZzZUx3YU1PQWVDRnphbVJWSmppUDRhTnRlaFQ4NkhZaUMifQ.zAOKzbTDVJjoD5uARaW0hN0OLDfzQ2FuKyy33kyWFOQ\"\n",
    "\n",
    "def api_request(query):\n",
    "    \"\"\"\n",
    "    Make a GET request to the EOL API.\n",
    "    \n",
    "    Args:\n",
    "        query (string): a Cypher Query Language query to the EOL database\n",
    "    Returns:\n",
    "        dictionary of the JSON response from the API\n",
    "    \"\"\"\n",
    "\n",
    "    url = 'https://eol.org/service/cypher'\n",
    "    headers = {\n",
    "        \"accept\": \"application/json\",\n",
    "        \"authorization\": \"JWT \" + token\n",
    "    }\n",
    "    params = {\n",
    "        'query': query,\n",
    "        'format': 'cypher'\n",
    "    }  \n",
    "\n",
    "    response = requests.get(url, headers=headers, params=params)\n",
    "    if response.status_code != 200:\n",
    "        print('Error: ', response.status_code)\n",
    "\n",
    "#     pp = pprint.PrettyPrinter()\n",
    "#     pp.pprint(response.json())\n",
    "\n",
    "    return response.json()\n",
    "\n",
    "def get_available_traits(species):\n",
    "    query = 'MATCH (p:Page)-->(t:Trait)-[:predicate]->(q:Term) \\\n",
    "            WHERE p.canonical = \"{}\" \\\n",
    "            RETURN DISTINCT q.name AS trait \\\n",
    "            LIMIT 1000'.format(species)\n",
    "\n",
    "    return api_request(query)\n",
    "\n",
    "def get_species_relationships(species):\n",
    "    \"\"\"Get all traits that are a relationship with another species\"\"\"\n",
    "    query = 'MATCH (p:Page)-->(t:Trait)-->(q:Term) \\\n",
    "            WHERE p.canonical = \"{}\" \\\n",
    "            WITH p, q, t.object_page_id AS pageID \\\n",
    "            MATCH (s:Page) \\\n",
    "            WHERE s.page_id = pageID \\\n",
    "            RETURN DISTINCT p.canonical AS species, q.name AS action, s.canonical AS target \\\n",
    "            LIMIT 100'.format(species)\n",
    "\n",
    "    return api_request(query)\n",
    "\n",
    "def get_species_association_trait(species, trait):\n",
    "    query = 'MATCH (p:Page)-->(t:Trait)-->(q:Term) \\\n",
    "            WHERE p.canonical = \"{}\" AND q.name = \"{}\" \\\n",
    "            WITH p, q, t.object_page_id AS pageID \\\n",
    "            MATCH (s:Page) \\\n",
    "            WHERE s.page_id = pageID \\\n",
    "            RETURN DISTINCT p.canonical, q.name, s.canonical \\\n",
    "            LIMIT 100'.format(species, trait)\n",
    "\n",
    "    return api_request(query)\n",
    "\n",
    "def get_species_attributes(species):\n",
    "    query = 'MATCH (p:Page)-->(t:Trait)-[:predicate]->(r:Term), \\\n",
    "            (t)-[:object_term]->(q:Term) \\\n",
    "            WHERE p.canonical = \"{}\" \\\n",
    "            RETURN DISTINCT p.canonical, r.name, q.name \\\n",
    "            LIMIT 100'.format(species)\n",
    "\n",
    "    return api_request(query)\n",
    "\n",
    "def get_species_list_attribute_trait(species_list, trait):\n",
    "    query = 'MATCH (p:Page)-->(t:Trait)-[:predicate]->(r:Term), \\\n",
    "            (t)-[:object_term]->(q:Term) \\\n",
    "            WHERE p.canonical IN {} AND r.name = \"{}\" \\\n",
    "            RETURN DISTINCT p.canonical AS species, q.name AS value \\\n",
    "            LIMIT 100'.format(species_list, trait)\n",
    "\n",
    "    return api_request(query)\n",
    "\n",
    "\n",
    "def get_species_numeric_trait(species, trait):\n",
    "    query = 'MATCH (t:Trait)<-[:trait]-(p:Page), \\\n",
    "           (t)-[:predicate]->(pred:Term)-[:parent_term|:synonym_of*0..]->(parent:Term) \\\n",
    "           WHERE p.canonical = \"{}\" AND parent.name = \"{}\" \\\n",
    "           OPTIONAL MATCH (t)-[:units_term]->(units:Term) \\\n",
    "           RETURN p.canonical, pred.name, t.measurement, units.name, t.source \\\n",
    "           LIMIT 100'.format(species, trait)\n",
    "    return api_request(query)\n",
    "\n",
    "\n",
    "\n",
    "species_list = list(name_to_label.keys())\n",
    "# species_list = ['Acer rubrum']\n",
    "trait = 'habitat'\n",
    "\n",
    "data = []\n",
    "binary_data = []\n",
    "unique_values = set()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "plant height\n",
      "stem diameter\n",
      "Leaf mass per area\n",
      "leaf area\n",
      "seed mass\n",
      "ratio\n",
      "wood density\n",
      "Leaf nitrogen per dry mass\n",
      "leaf sheddability\n",
      "geographic distribution includes\n",
      "plant growth form\n",
      "protein potential\n",
      "graze animal palatability\n",
      "browse animal palatability\n",
      "fuelwood suitability\n",
      "vegetative spread rate\n",
      "grain type\n",
      "seedling survival\n",
      "seeds per pound\n",
      "seed spread rate\n",
      "plant propagation method\n",
      "seed period end\n",
      "fruit/seed persistence\n",
      "fruit/seed abundance\n",
      "seed period begin\n",
      "bloom period\n",
      "commercial availability\n",
      "low temperature tolerance\n",
      "shade tolerance\n",
      "salt tolerance\n",
      "soil depth\n",
      "precipitation tolerance\n",
      "planting density\n",
      "soil pH\n",
      "life cycle habit\n",
      "moisture use\n",
      "hedge tolerance\n",
      "frost free days\n",
      "fire tolerance\n",
      "primary macronutrient requirements\n",
      "drought tolerance\n",
      "germination requirements\n",
      "calcareous soil tolerance\n",
      "anaerobic soil tolerance\n",
      "soil requirements\n",
      "human/livestock toxicity\n",
      "shape\n",
      "resprout ability after clipping\n",
      "life span\n",
      "grass growth type\n",
      "shedability\n",
      "allelopathic effect\n",
      "growth rate\n",
      "primary growth form\n",
      "horticulture\n",
      "fruit or seed color\n",
      "foliage porosity summer\n",
      "foliage porosity winter\n",
      "foliage texture\n",
      "leaf color\n",
      "flower color\n",
      "fire resistance\n",
      "carbon-to-nitrogen ratio\n",
      "livestock bloat potential\n",
      "active growth period\n",
      "native range includes\n",
      "PlantHabit\n",
      "not invasive in\n",
      "is a component of\n",
      "is eaten by\n",
      "visited by\n",
      "parasitized by\n",
      "habitat\n",
      "introduced range includes\n",
      "Stem specific density\n",
      "leaf morphology\n",
      "seed dry mass\n",
      "Vegetative plant height\n",
      "plant lifeform\n",
      "Leaf lamina area\n",
      "photosynthetic pathway\n",
      "Leaf Complexity\n",
      "trophic guild\n",
      "woodiness\n",
      "carbon biomass\n",
      "produces\n",
      "sexual system\n",
      "{'plant height': 1, 'stem diameter': 1, 'Leaf mass per area': 1, 'leaf area': 1, 'seed mass': 1, 'ratio': 1, 'wood density': 1, 'Leaf nitrogen per dry mass': 1, 'leaf sheddability': 1, 'geographic distribution includes': 1, 'plant growth form': 1, 'protein potential': 1, 'graze animal palatability': 1, 'browse animal palatability': 1, 'fuelwood suitability': 1, 'vegetative spread rate': 1, 'grain type': 1, 'seedling survival': 1, 'seeds per pound': 1, 'seed spread rate': 1, 'plant propagation method': 1, 'seed period end': 1, 'fruit/seed persistence': 1, 'fruit/seed abundance': 1, 'seed period begin': 1, 'bloom period': 1, 'commercial availability': 1, 'low temperature tolerance': 1, 'shade tolerance': 1, 'salt tolerance': 1, 'soil depth': 1, 'precipitation tolerance': 1, 'planting density': 1, 'soil pH': 1, 'life cycle habit': 1, 'moisture use': 1, 'hedge tolerance': 1, 'frost free days': 1, 'fire tolerance': 1, 'primary macronutrient requirements': 1, 'drought tolerance': 1, 'germination requirements': 1, 'calcareous soil tolerance': 1, 'anaerobic soil tolerance': 1, 'soil requirements': 1, 'human/livestock toxicity': 1, 'shape': 1, 'resprout ability after clipping': 1, 'life span': 1, 'grass growth type': 1, 'shedability': 1, 'allelopathic effect': 1, 'growth rate': 1, 'primary growth form': 1, 'horticulture': 1, 'fruit or seed color': 1, 'foliage porosity summer': 1, 'foliage porosity winter': 1, 'foliage texture': 1, 'leaf color': 1, 'flower color': 1, 'fire resistance': 1, 'carbon-to-nitrogen ratio': 1, 'livestock bloat potential': 1, 'active growth period': 1, 'native range includes': 1, 'PlantHabit': 1, 'not invasive in': 1, 'is a component of': 1, 'is eaten by': 1, 'visited by': 1, 'parasitized by': 1, 'habitat': 1, 'introduced range includes': 1, 'Stem specific density': 1, 'leaf morphology': 1, 'seed dry mass': 1, 'Vegetative plant height': 1, 'plant lifeform': 1, 'Leaf lamina area': 1, 'photosynthetic pathway': 1, 'Leaf Complexity': 1, 'trophic guild': 1, 'woodiness': 1, 'carbon biomass': 1, 'produces': 1, 'sexual system': 1}\n"
     ]
    }
   ],
   "source": [
    "trait_counts = {}\n",
    "for species in species_list:\n",
    "    traits = get_available_traits(species)['data']\n",
    "    for trait, in traits:\n",
    "        if trait in trait_counts:\n",
    "            trait_counts[trait] += 1\n",
    "        else:\n",
    "            trait_counts[trait] = 1\n",
    "\n",
    "print(trait_counts)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If there are a lot of species, they won't all fit in one API request.\n",
    "Split the list into chunks of no more than 100 species at a time, and combine the results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "{'columns': ['species', 'value'],\n",
      " 'data': [['Acer rubrum', 'peatland'],\n",
      "          ['Acer rubrum', 'woodland canopy'],\n",
      "          ['Acer rubrum', 'swamp'],\n",
      "          ['Acer rubrum', 'upland soil'],\n",
      "          ['Acer rubrum', 'deciduous forest'],\n",
      "          ['Acer rubrum', 'forest'],\n",
      "          ['Acer rubrum', 'limestone'],\n",
      "          ['Acer rubrum', 'mountain'],\n",
      "          ['Acer rubrum', 'lake'],\n",
      "          ['Acer rubrum', 'histosol'],\n",
      "          ['Acer rubrum', 'coniferous forest'],\n",
      "          ['Acer rubrum', 'cliff'],\n",
      "          ['Acer rubrum', 'dune'],\n",
      "          ['Acer rubrum', 'plateau'],\n",
      "          ['Acer rubrum', 'woodland'],\n",
      "          ['Acer rubrum', 'flood plain'],\n",
      "          ['Acer rubrum', 'farm'],\n",
      "          ['Acer rubrum', 'coastal'],\n",
      "          ['Acer rubrum', 'hammock'],\n",
      "          ['Acer rubrum', 'sediment'],\n",
      "          ['Acer rubrum', 'river'],\n",
      "          ['Acer rubrum', 'river valley'],\n",
      "          ['Acer rubrum', 'lake shore'],\n",
      "          ['Acer rubrum', 'dry soil'],\n",
      "          ['Acer rubrum', 'delta'],\n",
      "          ['Acer rubrum', 'loam'],\n",
      "          ['Acer rubrum', 'marsh'],\n",
      "          ['Acer rubrum', 'savanna'],\n",
      "          ['Acer rubrum', 'canal'],\n",
      "          ['Acer rubrum', 'prairie'],\n",
      "          ['Acer rubrum', 'reservoir'],\n",
      "          ['Acer rubrum', 'temperate'],\n",
      "          ['Acer rubrum', 'mixed forest'],\n",
      "          ['Acer rubrum', 'terrestrial']]}\n"
     ]
    }
   ],
   "source": [
    "results = []\n",
    "while species_list:\n",
    "    print(len(species_list))\n",
    "    index = min(100, len(species_list))\n",
    "    results += get_species_list_attribute_trait(\n",
    "        species_list[:index], \n",
    "        trait)['data']\n",
    "    species_list = species_list[index:]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Make a list of all possible trait values (the set of all values returned by the API).\n",
    "This will be the header of the CSV output."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Make a list of the unique trait values, sorted alphabetically\n",
    "unique_values = sorted(list(set([row[1] for row in results])))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now we need to reformat the data. We want to map each species to all the trait values it has.\n",
    "\n",
    "Here we create a dictionary that maps `{'species name': {set of its trait values}}`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'Acer rubrum': {'cliff', 'peatland', 'delta', 'coniferous forest', 'woodland canopy', 'mountain', 'canal', 'limestone', 'mixed forest', 'flood plain', 'river valley', 'plateau', 'prairie', 'hammock', 'loam', 'reservoir', 'lake shore', 'swamp', 'deciduous forest', 'dune', 'farm', 'histosol', 'savanna', 'sediment', 'terrestrial', 'forest', 'marsh', 'dry soil', 'temperate', 'river', 'upland soil', 'woodland', 'coastal', 'lake'}}\n"
     ]
    }
   ],
   "source": [
    "data_dict = {}\n",
    "for row in results:\n",
    "    species = row[0]\n",
    "    value = row[1]\n",
    "    if species in data_dict:\n",
    "        data_dict[species].add(value)\n",
    "    else:\n",
    "        data_dict[species] = set({value})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Finally, to output the data in a useful CSV format, we turn it into a binary table.\n",
    "\n",
    "The rows are species names and the columns are trait values.\n",
    "\n",
    "Each cell is filled with a 1 if the species has that trait value, 0 if not.\n",
    "\n",
    "The output of this cell will be the data in CSV format. You can copy and paste this into a file."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "canal, cliff, coastal, coniferous forest, deciduous forest, delta, dry soil, dune, farm, flood plain, forest, hammock, histosol, lake, lake shore, limestone, loam, marsh, mixed forest, mountain, peatland, plateau, prairie, reservoir, river, river valley, savanna, sediment, swamp, temperate, terrestrial, upland soil, woodland, woodland canopy\n",
      "Acer rubrum, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1\n"
     ]
    }
   ],
   "source": [
    "binary_data = []\n",
    "for species, values in data_dict.items():\n",
    "    binary_row = [species]\n",
    "    for value in unique_values:\n",
    "        if value in values:\n",
    "            binary_row.append('1')\n",
    "        else:\n",
    "            binary_row.append('0')\n",
    "    binary_data.append(binary_row)\n",
    "    \n",
    "# Print out the data in CSV format\n",
    "print(','.join(unique_values))\n",
    "for row in binary_data:\n",
    "    print(','.join(row))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Replace spaces with underscores to get the tree node ID\n",
    "for row in binary_data:\n",
    "    species = row[0]\n",
    "    species_label = name_to_label[species]\n",
    "    species_label = species_label.replace(' ', '_')\n",
    "    print(species_label + ',' + ','.join(row[1:]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
